; domain
(define (domain barman)
  (:requirements :strips :typing)
  (:types hand level beverage dispenser container - object
  	  ingredient cocktail - beverage
          shot shaker - container)
  (:predicates  (ontable ?c - container)
                (holding ?h - hand ?c - container)
		(handempty ?h - hand)
		(empty ?c - container)
                (contains ?c - container ?b - beverage)
		(clean ?c - container)
                (used ?c - container ?b - beverage)
                (dispenses ?d - dispenser ?i - ingredient)
		(shaker-empty-level ?s - shaker ?l - level)
		(shaker-level ?s - shaker ?l - level)
		(next ?l1 ?l2 - level)
		(unshaked ?s - shaker)
		(shaked ?s - shaker)
                (cocktail-part1 ?c - cocktail ?i - ingredient)
                (cocktail-part2 ?c - cocktail ?i - ingredient))
		
  (:action grasp
             :parameters (?h - hand ?c - container)
             :precondition (and (ontable ?c) (handempty ?h))
             :effect (and (not (ontable ?c))
	     	     	  (not (handempty ?h))
			  (holding ?h ?c)))

  (:action leave
             :parameters (?h - hand ?c - container)
             :precondition (holding ?h ?c)
             :effect (and (not (holding ?h ?c))
	     	     	  (handempty ?h)
			  (ontable ?c)))
  
  (:action fill-shot
           :parameters (?s - shot ?i - ingredient ?h1 ?h2 - hand ?d - dispenser)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
	   		      (dispenses ?d ?i)
                              (empty ?s)
			      (clean ?s))
           :effect (and (not (empty ?s))
	   	   	(contains ?s ?i)
	   	   	(not (clean ?s))
			(used ?s ?i)))


  (:action refill-shot
           :parameters (?s - shot ?i - ingredient ?h1 ?h2 - hand ?d - dispenser)
           :precondition (and (holding ?h1 ?s)	   		      
                              (handempty ?h2)
	   		      (dispenses ?d ?i)
                              (empty ?s)
			      (used ?s ?i))
           :effect (and (not (empty ?s))
                        (contains ?s ?i)))

  (:action empty-shot
           :parameters (?h - hand ?p - shot ?b - beverage)
           :precondition (and (holding ?h ?p)
                              (contains ?p ?b))
           :effect (and (not (contains ?p ?b))
	   	   	(empty ?p)))

  (:action clean-shot
  	   :parameters (?s - shot ?b - beverage ?h1 ?h2 - hand)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)	   		      
			      (empty ?s)
                              (used ?s ?b))
           :effect (and (not (used ?s ?b))
	   	   	(clean ?s)))

  (:action pour-shot-to-clean-shaker
           :parameters (?s - shot ?i - ingredient ?d - shaker ?h1 - hand ?l ?l1 - level)
           :precondition (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (empty ?d)
	   		      (clean ?d)                              
                              (shaker-level ?d ?l)
                              (next ?l ?l1))
           :effect (and (not (contains ?s ?i))
	   	   	(empty ?s)
			(contains ?d ?i)
                        (not (empty ?d))
			(not (clean ?d))
			(unshaked ?d)
			(not (shaker-level ?d ?l))
			(shaker-level ?d ?l1)))


  (:action pour-shot-to-used-shaker
           :parameters (?s - shot ?i - ingredient ?d - shaker ?h1 - hand ?l ?l1 - level)
           :precondition (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (unshaked ?d)
                              (shaker-level ?d ?l)
                              (next ?l ?l1))
           :effect (and (not (contains ?s ?i))
                        (contains ?d ?i)
	   	   	(empty ?s)     
  			(not (shaker-level ?d ?l))
			(shaker-level ?d ?l1)))

  (:action empty-shaker
           :parameters (?h - hand ?s - shaker ?b - cocktail ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
                              (contains ?s ?b)
			      (shaked ?s)
			      (shaker-level ?s ?l)
			      (shaker-empty-level ?s ?l1))
           :effect (and (not (shaked ?s))
	   	   	(not (shaker-level ?s ?l))
	   	   	(shaker-level ?s ?l1)
			(not (contains ?s ?b))
	   	   	(empty ?s)))

  (:action clean-shaker
  	   :parameters (?h1 ?h2 - hand ?s - shaker)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
                              (empty ?s))
           :effect (and (clean ?s)))
  
  (:action shake
  	   :parameters (?b - cocktail ?d1 ?d2 - ingredient ?s - shaker ?h1 ?h2 - hand)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
			      (contains ?s ?d1)
                              (contains ?s ?d2)
                              (cocktail-part1 ?b ?d1)
			      (cocktail-part2 ?b ?d2)
			      (unshaked ?s))			      
           :effect (and (not (unshaked ?s))
		        (not (contains ?s ?d1))
                        (not (contains ?s ?d2))
	   	   	(shaked ?s)
                        (contains ?s ?b)))

  (:action pour-shaker-to-shot
           :parameters (?b - beverage ?d - shot ?h - hand ?s - shaker ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
			      (shaked ?s)
			      (empty ?d)
			      (clean ?d)
			      (contains ?s ?b)
                              (shaker-level ?s ?l)
                              (next ?l1 ?l))
           :effect (and (not (clean ?d))
	   	   	(not (empty ?d))
			(contains ?d ?b)
			(shaker-level ?s ?l1)
			(not (shaker-level ?s ?l))))
 )

; problem
(define (problem prob)
 (:domain barman)
 (:objects 
      shaker1 - shaker
      left right - hand
      shot1 shot2 shot3 shot4 shot5 shot6 shot7 shot8 - shot
      ingredient1 ingredient2 - ingredient
      cocktail1 cocktail2 - cocktail
      dispenser1 dispenser2 - dispenser
      l0 l1 l2 - level
)
 (:init 
  (ontable shaker1)
  (ontable shot1)
  (ontable shot2)
  (ontable shot3)
  (ontable shot4)
  (ontable shot5)
  (ontable shot6)
  (ontable shot7)
  (ontable shot8)
  (dispenses dispenser1 ingredient1)
  (dispenses dispenser2 ingredient2)
  (clean shaker1)
  (clean shot1)
  (clean shot2)
  (clean shot3)
  (clean shot4)
  (clean shot5)
  (clean shot6)
  (clean shot7)
  (clean shot8)
  (empty shaker1)
  (empty shot1)
  (empty shot2)
  (empty shot3)
  (empty shot4)
  (empty shot5)
  (empty shot6)
  (empty shot7)
  (empty shot8)
  (handempty left)
  (handempty right)
  (shaker-empty-level shaker1 l0)
  (shaker-level shaker1 l0)
  (next l0 l1)
  (next l1 l2)
  (cocktail-part1 cocktail1 ingredient1)
  (cocktail-part2 cocktail1 ingredient2)
  (cocktail-part1 cocktail2 ingredient2)
  (cocktail-part2 cocktail2 ingredient1)
)
 (:goal
  (and
      (contains shot1 cocktail2)
      (contains shot2 cocktail1)
      (contains shot3 cocktail2)
      (contains shot4 ingredient1)
      (contains shot5 cocktail1)
      (contains shot6 cocktail2)
      (contains shot7 ingredient2)
)))

; plan
1. (grasp right shot4)
   deleted: (ontable shot4) (handempty right)
   added: (holding right shot4)
   goals met: 0 of 7
2. (fill-shot shot4 ingredient1 right left dispenser1)
   deleted: (empty shot4) (clean shot4)
   added: (contains shot4 ingredient1) (used shot4 ingredient1)
   goals met: 1 of 7
3. (grasp left shot7)
   deleted: (ontable shot7) (handempty left)
   added: (holding left shot7)
   goals met: 1 of 7
4. (pour-shot-to-clean-shaker shot4 ingredient1 shaker1 right l0 l1)
   deleted: (contains shot4 ingredient1) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot4) (contains shaker1 ingredient1) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 0 of 7
5. (leave right shot4)
   deleted: (holding right shot4)
   added: (handempty right) (ontable shot4)
   goals met: 0 of 7
6. (fill-shot shot7 ingredient2 left right dispenser2)
   deleted: (empty shot7) (clean shot7)
   added: (contains shot7 ingredient2) (used shot7 ingredient2)
   goals met: 1 of 7
7. (pour-shot-to-used-shaker shot7 ingredient2 shaker1 left l1 l2)
   deleted: (contains shot7 ingredient2) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient2) (empty shot7) (shaker-level shaker1 l2)
   goals met: 0 of 7
8. (refill-shot shot7 ingredient2 left right dispenser2)
   deleted: (empty shot7)
   added: (contains shot7 ingredient2)
   goals met: 1 of 7
9. (grasp right shaker1)
   deleted: (ontable shaker1) (handempty right)
   added: (holding right shaker1)
   goals met: 1 of 7
10. (leave left shot7)
   deleted: (holding left shot7)
   added: (handempty left) (ontable shot7)
   goals met: 1 of 7
11. (grasp left shot4)
   deleted: (ontable shot4) (handempty left)
   added: (holding left shot4)
   goals met: 1 of 7
12. (leave right shaker1)
   deleted: (holding right shaker1)
   added: (handempty right) (ontable shaker1)
   goals met: 1 of 7
13. (refill-shot shot4 ingredient1 left right dispenser1)
   deleted: (empty shot4)
   added: (contains shot4 ingredient1)
   goals met: 2 of 7
14. (grasp right shaker1)
   deleted: (ontable shaker1) (handempty right)
   added: (holding right shaker1)
   goals met: 2 of 7
15. (leave left shot4)
   deleted: (holding left shot4)
   added: (handempty left) (ontable shot4)
   goals met: 2 of 7
16. (shake cocktail1 ingredient1 ingredient2 shaker1 right left)
   deleted: (unshaked shaker1) (contains shaker1 ingredient1) (contains shaker1 ingredient2)
   added: (shaked shaker1) (contains shaker1 cocktail1)
   goals met: 2 of 7
17. (pour-shaker-to-shot cocktail1 shot2 right shaker1 l2 l1)
   deleted: (clean shot2) (empty shot2) (shaker-level shaker1 l2)
   added: (contains shot2 cocktail1) (shaker-level shaker1 l1)
   goals met: 3 of 7
18. (pour-shaker-to-shot cocktail1 shot5 right shaker1 l1 l0)
   deleted: (clean shot5) (empty shot5) (shaker-level shaker1 l1)
   added: (contains shot5 cocktail1) (shaker-level shaker1 l0)
   goals met: 4 of 7
19. (empty-shaker right shaker1 cocktail1 l0 l0)
   deleted: (shaked shaker1) (contains shaker1 cocktail1)
   added: (empty shaker1)
   goals met: 4 of 7
20. (clean-shaker right left shaker1)
   added: (clean shaker1)
   goals met: 4 of 7
21. (grasp left shot4)
   deleted: (ontable shot4) (handempty left)
   added: (holding left shot4)
   goals met: 4 of 7
22. (pour-shot-to-clean-shaker shot4 ingredient1 shaker1 left l0 l1)
   deleted: (contains shot4 ingredient1) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot4) (contains shaker1 ingredient1) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 3 of 7
23. (leave right shaker1)
   deleted: (holding right shaker1)
   added: (handempty right) (ontable shaker1)
   goals met: 3 of 7
24. (refill-shot shot4 ingredient1 left right dispenser1)
   deleted: (empty shot4)
   added: (contains shot4 ingredient1)
   goals met: 4 of 7
25. (leave left shot4)
   deleted: (holding left shot4)
   added: (handempty left) (ontable shot4)
   goals met: 4 of 7
26. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 4 of 7
27. (grasp right shot7)
   deleted: (ontable shot7) (handempty right)
   added: (holding right shot7)
   goals met: 4 of 7
28. (pour-shot-to-used-shaker shot7 ingredient2 shaker1 right l1 l2)
   deleted: (contains shot7 ingredient2) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient2) (empty shot7) (shaker-level shaker1 l2)
   goals met: 3 of 7
29. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 3 of 7
30. (refill-shot shot7 ingredient2 right left dispenser2)
   deleted: (empty shot7)
   added: (contains shot7 ingredient2)
   goals met: 4 of 7
31. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 4 of 7
32. (leave right shot7)
   deleted: (holding right shot7)
   added: (handempty right) (ontable shot7)
   goals met: 4 of 7
33. (shake cocktail2 ingredient2 ingredient1 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient2) (contains shaker1 ingredient1)
   added: (shaked shaker1) (contains shaker1 cocktail2)
   goals met: 4 of 7
34. (pour-shaker-to-shot cocktail2 shot1 left shaker1 l2 l1)
   deleted: (clean shot1) (empty shot1) (shaker-level shaker1 l2)
   added: (contains shot1 cocktail2) (shaker-level shaker1 l1)
   goals met: 5 of 7
35. (pour-shaker-to-shot cocktail2 shot3 left shaker1 l1 l0)
   deleted: (clean shot3) (empty shot3) (shaker-level shaker1 l1)
   added: (contains shot3 cocktail2) (shaker-level shaker1 l0)
   goals met: 6 of 7
36. (empty-shaker left shaker1 cocktail2 l0 l0)
   deleted: (shaked shaker1) (contains shaker1 cocktail2)
   added: (empty shaker1)
   goals met: 6 of 7
37. (clean-shaker left right shaker1)
   added: (clean shaker1)
   goals met: 6 of 7
38. (grasp right shot4)
   deleted: (ontable shot4) (handempty right)
   added: (holding right shot4)
   goals met: 6 of 7
39. (pour-shot-to-clean-shaker shot4 ingredient1 shaker1 right l0 l1)
   deleted: (contains shot4 ingredient1) (empty shaker1) (clean shaker1) (shaker-level shaker1 l0)
   added: (empty shot4) (contains shaker1 ingredient1) (unshaked shaker1) (shaker-level shaker1 l1)
   goals met: 5 of 7
40. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 5 of 7
41. (refill-shot shot4 ingredient1 right left dispenser1)
   deleted: (empty shot4)
   added: (contains shot4 ingredient1)
   goals met: 6 of 7
42. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 6 of 7
43. (leave right shot4)
   deleted: (holding right shot4)
   added: (handempty right) (ontable shot4)
   goals met: 6 of 7
44. (grasp right shot7)
   deleted: (ontable shot7) (handempty right)
   added: (holding right shot7)
   goals met: 6 of 7
45. (pour-shot-to-used-shaker shot7 ingredient2 shaker1 right l1 l2)
   deleted: (contains shot7 ingredient2) (shaker-level shaker1 l1)
   added: (contains shaker1 ingredient2) (empty shot7) (shaker-level shaker1 l2)
   goals met: 5 of 7
46. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 5 of 7
47. (refill-shot shot7 ingredient2 right left dispenser2)
   deleted: (empty shot7)
   added: (contains shot7 ingredient2)
   goals met: 6 of 7
48. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 6 of 7
49. (leave right shot7)
   deleted: (holding right shot7)
   added: (handempty right) (ontable shot7)
   goals met: 6 of 7
50. (shake cocktail2 ingredient2 ingredient1 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient2) (contains shaker1 ingredient1)
   added: (shaked shaker1) (contains shaker1 cocktail2)
   goals met: 6 of 7
51. (pour-shaker-to-shot cocktail2 shot6 left shaker1 l2 l1)
   deleted: (clean shot6) (empty shot6) (shaker-level shaker1 l2)
   added: (contains shot6 cocktail2) (shaker-level shaker1 l1)
   goals met: 7 of 7
